Revit 2026 API

# ParameterClearValue Method

---

Clears the parameter to its initial value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ClearValue()
```
```vb
Public Function ClearValue As Boolean
```
```cpp
public:
bool ClearValue()
```
```fsharp
member ClearValue : unit -> bool
```

#### Return Value

BooleanThe ClearValue method will return True if the parameter was successfully cleared to its initial value, otherwise false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The parameter is read-only, or the parameter is not a shared parameter, or the shared parameter has HideWhenNoValue set to false. |

This method will only succeed for Shared parameters that have their HideWhenNoValue property set to true.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace